OpenFOAM-5/chapter4/multiRegionHeater/constant/air/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/air";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//thermoType      hRhoThermo<pureMixture<constTransport<specieThermo<hConstThermo<perfectGas>>>>>; //synatx for previous OpenFOAM versions
thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.9;
    }
    thermodynamics
    {
        Cp              1000;
        Hf              0;
    }
    transport
    {
        mu              1.8e-05;
        Pr              0.7;
    }
}

/*
thermoType	hRhoThermo<pureMixture<constTransport<specieThermo<hConstThermo<incompressible>>>>>; //for incompressible 

mixture
{

    specie
    {
        nMoles          1;
        molWeight       18;
    }

    equationOfState
    {
        rho             1000;
    }
  
  thermodynamics
    {
        Cp              4181;
        Hf              0;
    }
  
  transport
    {
        mu              959e-6;
        Pr              6.62;
    }
*/
}




// ************************************************************************* //
