OpenFOAM-5/chapter4/multiRegionHeater/system/README
fvSolution is used for outer correctors specification.
fvSchemes is only so that pre-processing activities can proceed

